app/views/employees/_employee_lists.html.erb

            <td><%= employee.current_assignment.nil? ? 'n/a' : link_to(employee.current_assignment.store.name, store_path(employee.current_assignment.store))  %></td>
            <td><%= employee.shifts.missed.count %></td>
            <td><%= employee.shifts.finished.count %></td>
---
SELECT COUNT(*) FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."employee_id" = ? AND (shifts.id IN (NULL))
SELECT COUNT(*) FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."employee_id" = ? AND (status = 'finished')