app/views/stores/_stores_list.html.erb

SELECT  "employees".* FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ? AND (role = 'manager') ORDER BY "employees"."id" ASC LIMIT ?
SELECT COUNT(*) FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."store_id" = ? AND (date < '2020-05-04') AND (status = 'pending')
SELECT COUNT(*) FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ? AND (date_of_birth > '2002-05-04')
SELECT COUNT(*) FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ?
---
            <td><%= link_to store.name, store_path(store) %></td>
            <td><%= link_to store.employees.managers.first.proper_name, employee_path(store.employees.managers) %></td>
            <td><%= store.shifts.past.pending.count %></td>
            <td><%= store.employees.younger_than_18.count %></td>
            <td><%= store.employees.count %></td>