app/views/home/index.html.erb

SELECT  "employees".* FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ? AND (role = 'manager') ORDER BY "employees"."id" ASC LIMIT ?
SELECT COUNT(*) FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ? AND (date_of_birth > '2002-05-04') AND "employees"."active" = ?
SELECT COUNT(*) FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ? AND "employees"."active" = ?
---
	            <td><%= link_to store.name, store_path(store) %></td>
	            <td><%= link_to store.employees.managers.first.proper_name, employee_path(store.employees.managers) %></td>
	            <td><%= store.employees.younger_than_18.active.count %></td>
	            <td><%= store.slacker_count %></td>
	            <td><%= store.employees.active.count %></td>