app/controllers/application_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?
---
  def current_employee
    @current_employee ||= Employee.find(session[:employee_id]) if session[:employee_id]