app/models/employee.rb

SELECT COUNT(*) FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."employee_id" = ? AND (shifts.id IN (NULL))
SELECT COUNT(*) FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."employee_id" = ? AND (status = 'finished')
---
  def is_slacker # labels the employee as a slacker if he misses 20% of shifts
    missed_shifts = self.shifts.missed.count
    total_shifts = self.shifts.finished.count

SELECT  1 AS one FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) LIMIT ?
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) ORDER BY "assignments"."id" ASC LIMIT ?
---
  def current_assignment
    curr_assignment = self.assignments.current
    return nil if curr_assignment.empty?
    curr_assignment.first   # return as a single object, not an array