app/models/shift.rb

  scope :for_employee,  ->(employee) { joins(:assignment, :employee).where("assignments.employee_id = ?", employee.id) }
---
SELECT "shifts".* FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."employee_id" = ? AND (date < '2020-05-04') AND (status = 'pending')