app/models/store.rb

SELECT "employees".* FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ?
---
  def slacker_count
    employees = self.employees
    count = 0
    employees.each do |emp|